<sect>Introduction
<p>
<!--
Ce manuel est disponible en plusieurs langues. La version anglaise est le document maitre et sera mise a jour en premier.
-->
<sect1>A propos
<p>
<bf>
<url url="http://www.gnugk.org/" name="OpenH323 Gatekeeper - The GNU Gatekeeper">
</bf>
est un projet open-source qui impl&#233;mente un gatekeeper H.323. Un gatekeeper fournit des services de contr&#244;le d'appel pour les terminaux H.323. Il s'agit d'une partie essentielle de la plupart des installations de t&#233;l&#233;phonie sur internet qui sont bas&#233;es sur la norme H.323.

Selon la recommandation H.323, un gatekeeper doit fournir les services suivants:
<itemize>
<item>Traduction d'Adresse
<item>Contr&#244;le d'Admissions
<item>Contr&#244;le de Bande Passante
<item>Gestion de Zone
<item>Call Control Signaling
<item>Autorisation d'Appel
<item>Gestion de Bande Passante
<item>Gestion des Appels
</itemize>

Le GNU Gatekeeper impl&#233;mente la plupart des fonctions bas&#233;es sur la pile du protocole
<url url="http://sourceforge.net/projects/openh323" name="OpenH323">. 

La recommandation H.323 est une norme internationale publi&#233;e par l'
<url url="http://www.itu.int/" name="ITU">. Il s'agit d'une norme de communication pour l'audio, la vid&#233;o et les donn&#233;es sur Internet.
Voir aussi
<url url="http://www.packetizer.com/voip/h323/papers/primer/" name="l'introduction &#224; la s&#233;rie des normes H.323"> de Paul Jones.

Pour une description de ce que fait un gatekeeper, voir
<url url="http://www.iec.org/online/tutorials/h323/topic06.html" name="ici">.

<sect1>Copyright
<p>
Le GNU Gatekeeper est couvert par la
<htmlurl url="http://www.gnu.org/licenses/gpl.html" name="GNU General Public License"> (GNU GPL).
En suppl&#233;ment de celle-ci, nous autorisons explicitement &#224; allier ce code &#224; la biblioth&#233;que OpenH323/OpenH323Plus et &#224; la biblioth&#233;que OpenSSL.

Certains protocoles impl&#233;ment&#233;s par GNU Gatekeeper sont couverts par des brevets (en particulier le pare-feu/protocoles NAT transverses). Pour autant que nous sachions, le projet GNU Gatekeeper a une license valide pour leur utilisation. Cependant, les utilisateurs d&#233;sirant faire des versions d&#233;rv&#233;es de ce code doivent s'assurer qu'ils ont une license valide avant d'activer ces fonctionnalit&#233;s. 

De mani&#232;re g&#233;n&#233;rale, la GNU GPL vous autorise &#224; copier, distribuer, revendre ou modifier les logiciels, mais elle requi&#232;re que toutes les cr&#233;ations d&#233;riv&#233;es soient aussi publi&#233;es sous GNU GPL.
Ceci signifie que vous devez publier tout le code source de toutes les extensions &#224; gatekeeper et de tous les programmes qui incluent gatekeeper. Voir le fichier COPYING pour les d&#233;tails.

Si ce n'est pas ce que vous voulez, vous devez vous interfacer au gatekeeper au travers du port d'&#233;tat et communiquer par TCP avec lui.
De cette mani&#232;re vous devez seulement int&#233;grer les fonctions de base dans le gatekeeper (et en fournir les sources) et garder les autres parties de votre application priv&#233;es.

<sect1>Nom
<p>
Le nom exact de ce projet est <em>GNU Gatekeeper</em>, mais il peut aussi &#234;tre appel&#233; <em>GnuGk</em>. L'utilisation de "GNU" dans ce nom est pour mettre en valeur le fait qu'il s'agit d'un logiciel libre. 

<sect1>T&#233;l&#233;chargement
<label id="download">
<p>
La derni&#232;re version est disponible sur <url url="http://www.gnugk.org/h323download.html" name="la page de t&#233;l&#233;chargement">.

La toute derni&#232;re version du code source est sous CVS sur
<url url="http://openh323gk.cvs.sourceforge.net/openh323gk/openh323gk/" name="Sourceforge Web-GUI">.
Attention - il s'agit d'une version encore en d&#233;veloppement.

Vous pouvez aussi t&#233;l&#233;charger certains ex&#233;cutables depuis <url url="http://www.gnugk.org/h323download.html" name="la page de t&#233;l&#233;chargement">.

<sect1>Liste de Diffusion
<p>
Il y a deux listes de diffusion pour le projet, une pour les d&#233;veloppeurs et une pour les utilisateurs.

Les questions d'ordre g&#233;n&#233;ral doivent &#234;tre envoy&#233;es &#224; la
<url url="mailto:Openh323gk-users@sourceforge.net" name="liste de diffusion des utilisateurs">.
Vous pouvez trouver les archives de la liste
<url url="http://sourceforge.net/mailarchive/forum.php?forum_name=openh323gk-users" name="ici">.
Pour vous joindre &#224; cette liste de diffusion, cliquez
<url url="http://lists.sourceforge.net/lists/listinfo/openh323gk-users" name="ici">.

Pour signaler des probl&#232;mes ou des anomalies/patchs, envoyer des mails &#224; la
<url url="mailto:Openh323gk-developer@sourceforge.net" name="liste de diffusion des d&#233;veloppeurs">.
Les archives de la liste sont
<url url="http://sourceforge.net/mailarchive/forum.php?forum_name=openh323gk-developer" name="ici">.
Veuillez envoyer les questions utilisateur &#224; la liste de diffusion des utilisateurs et garder cette liste pour le d&#233;veloppement! Si vous voulez contribuer au projet, veuillez
<url url="http://lists.sourceforge.net/lists/listinfo/openh323gk-developer" name="rejoindre la liste de diffusion">.

<sect1>Participants
<p>
Le coordinateur actuel du projet est
<url url="http://www.willamowius.com/gnugk-support.html" name="Jan Willamowius">
<tt><htmlurl url="mailto:jan@willamowius.de" name="&lt;jan@willamowius.de&gt;"></tt>

Les principales caract&#233;ristiques et fonctions de la version 2.0 ont &#233;t&#233; contribu&#233;es par Chih-Wei Huang et Citron Network Inc., incluant l'enregistrement et les tables d'appel thread safe, une nouvelle architecture de mode rout&#233;, proxy H.323, l'authentification H.235 et le backend MySQL.

Michal Zygmuntowicz <tt><htmlurl url="mailto:m.zygmuntowicz@onet.pl" name="&lt;m.zygmuntowicz@onet.pl&gt;"></tt> a fait du bon travail sur le support de Radius et d'autres am&#233;liorations.

La version initiale de gatekeeper a &#233;t&#233; d&#233;velopp&#233;e par
Xiang Ping Chen, Joe Metzger et Rajat Todi.
