<!-- French translation from ras.sgml v1.2 -->

<sect>Configuration RAS
<p>
<sect1>Section &lsqb;RasSrv::GWPrefixes&rsqb;
<p>
Cette section liste quels num&#233;ros E.164 sont rout&#233;s vers une passerelle
sp&#233;cifique.

<descrip>
<tag/Format:/
<tt>gw-alias=prefix[,prefix,...]</tt>
<p>
Il faut noter que vous devez indiquer l'alias de la passerelle.
Si une passerelle est enregistr&#233;e pour cet alias, tous les num&#233;ros
commen&#231;ant par les pr&#233;fixes sont rout&#233;s vers cette passerelle.
Les caract&#232;res sp&#233;ciaux <tt/./ et <tt/!/ peuvent &#234;tre utilis&#233;s
ici pour correspondre &#224; n'importe quel chiffre et d&#233;sactiver le pr&#233;fixe.
<tag/Exemple:/
<tt/test-gw=02,03/
</descrip>


<sect1>Section &lsqb;RasSrv::PermanentEndpoints&rsqb;
<p>
Dans cette section vous pouvez mettre des terminaux qui n'ont pas le support RAS ou
que vous ne souhaitez pas voir expirer. Les enregistrements seront toujours
conserv&#233;s dans le table d'enregistrements du gatekeeper.
Cependant, vous pouvez toujours le d&#233;senregistrer par le port d'&#233;tat.
Les caract&#232;res sp&#233;ciaux <tt/./ et <tt/!/ peuvent &#234;tre utilis&#233;s
avec les pr&#233;fixes ici pour correspondre &#224; n'importe quel chiffre et
d&#233;sactiver le pr&#233;fixe.

<descrip>
<tag/Format:/
<tt>IP[:port]=alias[,alias,...;prefix,prefix,...]</tt>
<tag/Exemple:/
Pour une passerelle,
<quote/<tt/10.0.1.5=Citron;009,008//
Pour un terminal,
<quote/<tt/10.0.1.10:1720=700//
</descrip>


<sect1>Section &lsqb;RasSrv::RRQFeatures&rsqb;
<p>
<itemize>
<item><tt/AcceptEndpointIdentifier=1/<newline>
D&#233;fault: <tt/1/
<p>
Indique si on accepte <bf/endpointIdentifier/ indiqu&#233; dans un RRQ complet.

<item><tt/AcceptGatewayPrefixes=1/<newline>
D&#233;fault: <tt/1/
<p>
Une passerelle peut enregistrer ses pr&#233;fixes avec le gatekeeper  en contenant
<bf/supportedPrefixes/ dans le champ <bf/terminalType/ du RRQ.
Cette option indique si on accepte les pr&#233;fixes de cette passerelle.

<item><tt/OverwriteEPOnSameAddress=1/<newline>
D&#233;fault: <tt/0/
<p>
Dans certains r&#233;seaux l'adresse IP d'un terminal peut changer de fa&#231;on
inattendue. Ceci peut se produire quand un terminal utilise une connexion PPP
(e.g. modem ou ADSL). Cette option indique comment g&#233;rer un demande
d'enregistrement (RRQ) d'une adresse IP qui ne correspond pas &#224; ce que nous
avons stock&#233;. L'action par d&#233;faut est de rejeter la requ&#234;te. Avec
cette option activ&#233;e la requ&#234;te contradictoire entra&#238;nera une
requ&#234;te non-enregistr&#233; (URQ) &#224; &#234;tre envoy&#233;e pour l'adresse IP
existante et l'entr&#233;e est supprim&#233;e pour permettre le terminal de
s'enregistrer avec la nouvelle adresse.

<item><tt/IRQPollCount=0/<newline>
D&#233;fault: <tt/1/
<p>
Quand le gatekeeper ne re&#231;oit pas un RRQ garder-en-vie d'un terminal pendant une
p&#233;riode de temps TimeToLive, il envoie un message IRQ pour "sonder" le terminal et
v&#233;rifier si il est en vie. Apr&#232;s que IRQPollCount messages aient &#233;t&#233;
envoy&#233;s sans qu'aucune r&#233;ponse n'ait &#233;t&#233; re&#231;ue, le terminal est
d&#233;senregistr&#233;. Pour d&#233;sactiver cette fonction (et d&#233;senregistrer les
terminaux juste apr&#233;s TimeToLive), r&#233;gler cette variable &#224; 0.
L'intervalle de sondage IRQ est de 60 secondes.

</itemize>


<sect1>Section &lsqb;RasSrv::ARQFeatures&rsqb;
<p>
<itemize>
<item><tt/ArjReasonRouteCallToSCN=0/<newline>
D&#233;fault: <tt/1/
<p>
Si oui, le gatekeeper rejette un appel d'une passerelle &#224; elle-m&#234;me avec
la raison <bf/routeCallToSCN/.

<item><tt/ArjReasonRouteCallToGatekeeper=1/<newline>
D&#233;fault: <tt/1/
<p>
Si oui, le gatekeeper rejette un ARQ r&#233;pondu sans un CallRec pr&#233;existant
dans la CallTable avec la raison <bf/routeCallToGatekeeper/ en mode rout&#233;.
Le terminal doit lib&#233;rer l'appel imm&#233;diatement et renvoyer l'appel Setup
au gatekeeper.

<item><tt/CallUnregisteredEndpoints=0/<newline>
D&#233;fault: <tt/1/
<p>
Avec cette option activ&#233;e, le gatekeeper acceptera un ARQ d'un terminal
enregistr&#233; avec <bf/destCallSignalAddress/, que l'adresse appartienne &#224;
un terminal enregistr&#233; ou non.
Ceci signifie que vous pouvez explicitement indiquer l'IP du terminal (enregistr&#233;
ou non) que vous voulez appeler.

<item><tt/RemoveTrailingChar=#/<newline>
D&#233;fault: <tt>N/A</tt>
<p>
Indique le caract&#232;re de fin &#224; supprimer de <bf/destinationInfo/.
Par exemple, si votre terminal contient de mani&#232;re erron&#233;e le caract&#232;re
de fin tel que `&num;' dans <bf/destinationInfo/, vous pouvez le supprimer avec
cette option.

<item><tt/RoundRobinGateways=0/<newline>
D&#233;fault: <tt/1/
<p>
Active/d&#233;sactive la s&#233;lection round-robin(?) de passerelle, si plus d'une
passerelle correspond &#224; un num&#233;ro compos&#233;. Si d&#233;sactiv&#233;, la
premi&#232;re passerelle disponible sera s&#233;lectionn&#233;e. Autrement, les
appels suivants seront envoy&#233;s &#224; chaque passerelle &#224; son tour.

</itemize>


<sect1>Section &lsqb;NATedEndpoints&rsqb;
<p>
Le gatekeeper peut d&#233;tecter automatiquement si un terminal est derri&#232;re
un routeur. Cependant, si la d&#233;tection &#233;choue, vous pouvez l'indiquer
manuellement dans cette section.

<descrip>
<tag/Format:/
<tt/alias=true,yes,1,.../
<tag/Exemple:/
Indique qu'un terminal avec l'alias 601 est derri&#232;re un routeur.
<quote/<tt/601=true//
</descrip>
