<!-- French translation from reference.sgml v1.2 -->

<sect>Configuration Basique du Gatekeeper
<p>
Le comportement du gatekeeper est compl&#232;tement d&#233;termin&#233; par
les options de la ligne de commande et le fichier de configuration. Certaines
options de la ligne de commande peuvent annuler certains param&#232;tres du
fichier de configuration.
Par exemple, l'option <tt/-l/ annule le param&#232;tre <tt/TimeToLive/
dans le fichier de configuration.

<sect1>Options de la Ligne de Commande
<label id="commandline">
<p>
Presque chaque option a un format court et un format long, i.e.,
<tt/-c/ est comme <tt/--config/.
<p>
<sect2>Basique
<p>
<descrip>
<tag/<tt/-h  --help//
Liste toutes les options disponibles et quitte le programme.
<tag/<tt/-c  --config filename//
Indique le fichier de configuration &#224; utiliser.
<tag/<tt/-s  --section section//
Indique quelle section principale utiliser dans le fichier de configuration.
Par d&#233;faut, c'est [Gatekeeper::Main].
<tag/<tt/-i  --interface IP//
Indique l'interface (num&#233;ro IP) sur laquelle &#233;coute le gatekeeper.
Vous devriez omettre cette option pour laisser le gatekeeper d&#233;terminer
automatiquement l'IP sur laquelle il &#233;coute, &#224; moins que vous ne
vouliez que le gatekeeper s'attache &#224; une IP pr&#233;cise.
<tag/<tt/-l  --timetolive n//
Indique la minuterie (en secondes) du temps-&#224;-vivre pour l'enregistrement
de terminal. Il annule le param&#232;tre <tt/TimeToLive/ du fichier de
configuration. Voir <ref id="ttl" name="ici"> pour des explications
d&#233;taill&#233;es.
<tag/<tt/-b  --bandwidth n//
Indique la bande passante totale disponible pour le gatekeeper.
En ne pr&#233;cisant pas cette option, la gestion de la bande passante est
d&#233;sactiv&#233;e par d&#233;faut.
<tag/<tt/--pid filename//
Indique le fichier pid, valable uniquement pour les versions Unix.
<tag/<tt/-u  --user name//
Ex&#233;cute le processus gatekeeper avec cet utilisateur. Valable uniquement
pour les version Unix.
<tag/<tt/--core n//
(Unix seulement) Permet l'&#233;criture de fichiers core dump quand l'application
plante. Un fichier core dump ne d&#233;passera pas la taille de n octets. Une constante
sp&#233;ciale "unlimited" peut &#234;tre utilis&#233;e pour ne pas imposer de limite.
</descrip>

<sect2>Mode du Gatekeeper
<p>
Les options de cette sous-section annulent les param&#232;tres de la
<ref id="routed" name="section [RoutedMode]"> du fichier de configuration.
<descrip>
<tag/<tt/-d  --direct//
Utilise le signal d'appel direct de terminal.
<tag/<tt/-r  --routed//
Utilise le signal d'appel rout&#233; du gatekeeper.
<tag/<tt/-rr  --h245routed//
Utilise le signal d'appel rout&#233; du gatekeeper et le canal de
contr&#244;le H.245.
</descrip>

<sect2>Information de Debug
<p>
<descrip>
<tag/<tt/-o  --output filename//
Ecrit les traces dans le fichier indiqu&#233;.
<tag/<tt/-t  --trace//
R&#232;gle le niveau de trace. Plus vous ajoutez de <tt/-t/, plus les traces
sont compl&#232;tes.
Par exemple, utiliser <tt/-ttttt/ pour r&#233;gler le niveau de trace &#224; 5.
</descrip>
