<!-- French translation from tutorial.sgml v1.2 -->

<sect>Tutoriel
<p>
<sect1>Un premier exemple tr&#232;s simple
<p>
Pour s'assurer que tous les composants fonctionnent, trouvez
2 stations de travail Linux, toutes les deux connect&#233;es au r&#233;seau local.
Ces exemples utilisent &#233;galement le logiciel "OhPhone".
Sur la premi&#232;re machine, &#233;x&#233;cuter le <htmlurl url="http://www.gnugk.org/"name="gatekeeper"> en mode direct:

<tscreen><verb>
jan@machine1 > gnugk -ttt
</verb></tscreen>

L'option "<tt/-ttt/" indique au gatekeeper d'&#233;crire un maximum de traces de debug dans la console (vous pouvez rediriger cette sortie vers un fichier avec la commande 
"<tt/-o logfilename/").

D&#233;marrer maintenant OhPhone dans une autre console:
<tscreen><verb>
jan@machine1 > ohphone -l -a -u jan
</verb></tscreen>

Cet OhPhone est maintenant &#224; l'&#232;coute d'appels entrants(<tt/-l/) et les acceptera automatiquement (<tt/-a/). Il s'est enregistr&#233; comme utilisateur jan aupr&#232;s du gatekeeper. OhPhone tentera de d&#233;terminer automatiquement la location du gatekeeper, mais si cette d&#233;tection automatique &#233;choue, utiliser "<tt/-g 1.2.3.4/" pour sp&#233;cifier l'addresse IP du gatekeeper. 

Sur la deuxi&#232;me machine, d&#233;marer ohphone de cette mani&#232;re:

<tscreen><verb>
peter@machine2 > ohphone -u peter jan
</verb></tscreen>

La deuxi&#232;me instance de OhPhone s'enregistre aupr&#232;s du gatekeeper d&#233;tect&#233; automatiquement en tant qu'utilisateur peter et essaye d'appeler jan.
Le gatekeeper d&#233;terminera le num&#233;ro IP sous lequel jan s'est enregistr&#233; (machine1 dans ce cas) et OhPhone appellera l'autre instance de OhPhone sur machine1.

L'instance d'OhPhone sur machine1 acceptera automatiquement cet appel: Peter et Jan pourront parler.

<sect1>Utilisation de l'interface Status pour surveiller le gatekeeper
<p>
L'interface Status est une mani&#232;re d'int&#233;ragir avec un gatekeeper en cours d'&#233;x&#233;cution &#224; l'aide de texte. 

Dans une nouvelle console sur machine1 nous utilisons telnet pour nous connecter au gatekeeper:

<tscreen><verb>
jan@machine1 > telnet machine1 7000
</verb></tscreen>

Vous devriez recevoir un message "Acc&#232;s interdit!" car l'acc&#232;s &#224; ce port est restreint par d&#233;faut. 

Cr&#233;er maintenant un fichier appel&#233; <tt/gatekeeper.ini/ dans le r&#233;pertoire o&#249; dans lequel nous d&#233;marrons le gatekeeper.
<tt/gatekeeper.ini/ contient seulement 4 lignes:

<tscreen><verb>
[Gatekeeper::Main]
Fortytwo=42
[GkStatus::Auth]
rule=allow
</verb></tscreen>

Arr&#234;ter le gatekeeper avec Ctrl-C, red&#233;marrer le gatekeeper en sp&#233;cifiant qu'il doit utiliser le <tt/gatekeeper.ini/ qui vient d'&#234;tre cr&#233;&#233;.

<tscreen><verb>
jan@machine1 > gnugk -ttt -c ./gatekeeper.ini
</verb></tscreen>

Utiliser telent pour se connecter au port 700 et vous devrez maintenant &#234;tre autoris&#233; &#224; vous connecter au gatekeeper. 

<tscreen><verb>
jan@machine1 >  telnet localhost 7000
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.
Version:
Gatekeeper(GNU) Version(2.3.1) Ext(pthreads=1,radius=1,mysql=0,pgsql=0,firebird=0,odbc=0,sqlite=0,large_fdset=0,crypto/ssl=1,h46018=1,h46023=1) Build(Aug 12 2009, 09:30:37) Sys(Linux i686 2.6.28-14-generic)
Startup: Tue, 25 Aug 2009 15:30:44 -0500   Running: 2 days 21:30:50
;
</verb></tscreen>

R&#233;p&#233;tez maintenant le premier exemple lorsque Peter appelle Jan et observez quels messages sont trait&#233;s par le gatekeeper en mode non rout&#233;. 

Il y a de nombreuses commandes qui peuvent &#234;tre trait&#233;es dans la session telent - tapez "help" pour les voir. 

Pour quitter la session telnet avec le gatekeeper, tapez "quit" et appuyez sur Entr&#233;e. 

Cependant, l'exemple de fichier de configuration que nous avons cr&#233;&#233; n'est pas bien s&#233;curis&#233; car il a un param&#233;trage par d&#233;faut <bf/allow/, donc il n'y a aucune restriction sur qui peut se connecter et quelles commandes cet utilisateur peut ex&#233;cuter. 

Modifier le fichier de configuration de cette mani&#232;re:

<tscreen><verb>
[Gatekeeper::Main]
Fortytwo=42
[GkStatus::Auth]
rule=password
gkadmin=QC7VyAo5jEw=
</verb></tscreen>

La cinqui&#232;me ligne a &#233;t&#233; ajout&#233;e par l'utilitaire addpasswd, qui a &#233;t&#233; utilis&#233; pour cr&#233;&#233;r l'utilisateur "gkadmin" avec le mot de passe "secret. Ce changement permet l'authentification par le port d'&#233;tat. 

Red&#233;marrer le gatekeeper avec cette nouvelle configuration et &#233;x&#233;cutez telnet &#224; nouveau. On vous demande maintenant un nom d'utilisateur et un mot de passe. 

<tscreen><verb>
jan@machine1 >  telnet localhost 7000
Trying 127.0.0.1...
Connected to localhost.
Escape character is '^]'.

GnuGk login: gkadmin
Password: secret
Version:
Gatekeeper(GNU) Version(2.3.1) Ext(pthreads=1,radius=1,mysql=0,pgsql=0,firebird=0,odbc=0,sqlite=0,large_fdset=0,crypto/ssl=1,h46018=1,h46023=1) Build(Aug 12 2009, 09:30:37) Sys(Linux i686 2.6.28-14-generic)
Startup: Tue, 25 Aug 2009 15:30:44 -0500   Running: 2 days 21:33:32
;
</verb></tscreen>

La section <ref id="gkstatusauth" name="GkStatus::Auth"> contient plus d'informations sur la s&#233;curisation du port d'&#233;tat. 

<sect1>D&#233;marrage du gatekeeper en mode rout&#233
<p>
D&#233;marrer le gatekeeper en mode rout&#233; signifie que le gatekeeper
utilise la "signalisation rout&#233;e du gatekeeper" pour tous les appels. Dans ce
mode tous les messages de signalisation du gatekeeper passent par le gatekeeper
qui a beaucoup plus de contr&#244;le sur les appels.

D&#233;marrer GnuGk de la mani&#232;re suivante:
<tscreen><verb>
jan@machine1 > gnugk -r
</verb></tscreen>

Le gatekeeper tourne maintenant en mode rout&#233;. Faire un telnet sur le port d'&#233;tat et fa&#238;tes un appel pour voir quels messages sont maintenant trait&#233;s par le gatekeeper.

Noter que tous les paquets media (audio et vid&#233;o) sont toujours envoy&#233;s directement entre les terminaux (les 2 instances de ohphone).

<sect1>Un PBX virtuel: D&#233;connexion des appels
<p>
Jusqu'&#224; maintenant le gatekeeper a seulement servi de m&#233;canisme pour r&#233;soudre des noms symboliques en adresses IP. Il s'agit d'une fonction importante, mais le gatekeeper est capable de beaucoup plus. 

Puisque le gatekeeper a beaucoup de contr&#244;le sur les appels, il peut les terminer par exemple. Quand nous sommes connect&#233;s au port d'&#233;tat, nous
pouvons obtenir la liste de tous les appels en cours avec "<tt/PrintCurrentCalls/".
Pour terminer un appel, nous pouvons dire "<tt/Disconnectip 1.2.3.4/" pour un de
ses terminaux.

Quelqu'un pourrait par exemple &#233;crire un script simple qui se connecte au port
d'&#233;tat, surveille les appels en cours et les termine apr&#232;s 5 minutes, de
telle sorte qu'aucun utilisateur ne puisse abuser des ressources syst&#232;me.

Regardez les autres fonctions t&#233;l&#233;phoniques telles que TransferCall pour
voir ce qui est disponible.

<sect1>Routage d'appels sur une passerelle pour atteindre des utilisateurs externes
<p>
Sans utiliser de passerelle vous pouvez seulement appeler d'autres personnes avec un
t&#233;l&#233;phone IP sur Internet. Pour atteindre les gens disposant d'un
t&#233;l&#233;phone ordinaire vous devez utiliser une passerelle.

<tscreen><verb>
_________________          ______________
| endpoint "jan"|          |            |
| 192.168.88.35 |--------->| Gatekeeper |
|_______________|          |            |
_________________          |            |
| gateway "gw1" | outgoing |            |
| 192.168.88.37 |<---------|____________|
|_______________|
</verb></tscreen>

Le gatekeeper doit savoir quels appels sont suppos&#233;s &#234;tre rout&#233;s par
la passerelle et quels num&#233;ros doivent &#234;tre appel&#233;s directement.
Utilisez la section [RasSrv::GWPrefixes] du fichier de configuration pour indiquer au
gatekeeper le pr&#233;fixe des num&#233;ros qui doivent &#234;tre rout&#233;s par la
passerelle.

<tscreen><verb>
[RasSrv::GWPrefixes]
gw1=0
</verb></tscreen>

Cette entr&#233;e indique au gatekeeper de router tous les appels aux num&#233;ros E.164
qui commencent par 0 sur la passerelle qui s'est enregistr&#233;e avec l'alias H.323
"gw1". Si il n'y a pas de passerelle enregistr&#233;e avec cet alias l'appel
&#233;chouera. 

<bf>NB:</bf>Il faut noter que vous devez utiliser l'alias de la passerelle -
vous ne pouvez pas juste indiquer au gatekeeper l'addresse IP de la passerelle.

Un pr&#233;fixe peut contenir des chiffres <tt/0-9/, <tt/#/ et <tt/*/. Il peut aussi
contenir un carct&#232;re sp&#233;cial <tt/./ (un point) qui correspond &#224;
n'importe quel chiffre et peut &#234;tre pr&#233;fix&#233; par <tt/!/ (un point
d'exclamation) pour d&#233;sactiver le pr&#233;fixe.
La correspondance des pr&#233;fixes est faite en respectant la r&#232;gle du plus
long pr&#233;fixe correspondant, avec les r&#232;gles ! ayant une priorit&#233;
sup&#233;rieure si les longueurs sont &#233;gales. 
Quelques exemples:

<tscreen><verb>
[RasSrv::GWPrefixes]
; Cette entr&#233;e routera les num&#233;ros commen&#231;ant par 0048 (mais pas par
; 004850 et 004860) vers gw1
gw1=0048,!004850,!004860
; Cette entr&#233;e correspond uniquement &#224; 001 avec 10 chiffres apr&#232;s
gw2=001..........
</verb></tscreen>

<sect1>R&#233;&#233;criture de num&#233;ros E.164
<p>
Quand vous utilisez une passerelle vous devez souvent utiliser des num&#233;ros
diff&#233;rents en interne et les r&#233;&#233;crire avant de les envoyer par la
passerelle sur le r&#233;seau t&#233;l&#233;phonique. Vous pouvez utiliser la section
<ref id="rewrite" name="RasSrv::RewriteE164"> pour configurer ceci.

Exemple:
Vous voulez appeler le num&#233;ro 12345 avec votre t&#233;l&#233;phone IP et
atteindre le num&#233;ro 08765 derri&#232;re la passerelle "gw1".

<tscreen><verb>
[RasSrv::GWPrefixes]
gw1=0

[RasSrv::RewriteE164]
12345=08765
</verb></tscreen>

Vous pouvez aussi configurer la r&#233;&#233;criture de num&#233;ros E.164 en fonction
de quelle passerelle vous recevez un appel ou vous en envoyez un en utilisant la
section <ref id="gwrewrite" name="RasSrv::GWRewriteE164">.

Exemple:
Vous avez deux passerelles diff&#233;rentes ("gw1" et "gw2") auxquelles vous envoyez
des appels avec le pr&#233;fixe 0044, mais qui n&#233;cessitent l'ajout d'un
pr&#233;fixe diff&#233;rent apr&#232;s que le routage ait choisi la passerelle.
Ce peut &#234;tre par exemple pour des raisons d'identification.

<tscreen><verb>
[RasSrv::GWPrefixes]
gw1=0044
gw2=0044

[RasSrv::GWRewriteE164]
gw1=out=0044=77770044
gw2=out=0044=88880044
</verb></tscreen>

Exemple:
Vous voulez identifier les appels d'une passerelle particuli&#232;re "gw1" avec un
pr&#233;fixe sp&#233;cifique avant de passer ces appels &#224; une autre passerelle
"gw2".

<tscreen><verb>
[RasSrv::GWPrefixes]
gw2=1

[RasSrv::GWRewriteE164]
gw1=in=00=123400
</verb></tscreen>

Les expressions de r&#233;&#233;criture acceptent les caract&#232;res jokers point
<tt/'.'/ et pourcent <tt/'%'/ pour permettre de construire des r&#232;gles plus
g&#233;n&#233;rales. Le caract&#232;re point peut appara&#238;tre &#224; la fois
&#224; gauche et &#224; droite de l'expression, le signe pourcent peut
appara&#238;tre uniquement &#224; la gauche de l'expression. Utilisez <tt/'.'/ pour
indiquer n'importe quel caract&#232;re et le copier dans la cha&#238;ne
r&#233;&#233;crite et <tt/'%'/ pour indiquer n'importe quel caract&#232;re et
l'omettre.
Quelques exemples simples:

<tscreen><verb>
[RasSrv::RewriteE164]
; R&#233;&#233;crit 0044 + min. 7 chiffres en 44 + min. 7 digits
0044.......=44.......
; R&#233;&#233;crit les num&#233;ros commencant par 11 + 4 chiffres + 11 en 22 + 4 digits + 22
; (comme 11333311 => 22333322, 110000112345 => 220000222345)
11....11=22....22
; omet les 4 premiers chiffres de tous les num&#233;ros (11114858345 => 4858345)
; c'est &#233;quivalent &#224; 10 r&#232;gles %%%%1=1, %%%%2=2, ...
%%%%.=.
; ins&#232;re deux z&#233;ros au milieu du num&#233;ro (111148581234 => 11110048581234)
....48=....0048
; m&#234;me ceci est possible (415161 => 041051061)
4.5.6=04.05.06
</verb></tscreen>
 
